In [ ]:
CREATE table STUDENT (
SNUMB VARCHAR(30) not null,
LNAME VARCHAR(38) NOT null,
MAJOR VARCHAR (38) not null,
MINOR VARCHAR(30) NOT null,
ADVISOR_TNUMB VARCHAR (30) NOT NULL,
SEX VARCHAR (30) NOT NULL,
CONSTRAINT SNUMB_PK PRIMARY KEY(SNUMB));
   
INSERT INTO STUDENT VALUES ('S234','Thompson','mkt','comp-sci','t96','f');
INSERT INTO STUDENT VALUES ('S567','Black','eet','math','t82','f');
INSERT INTO STUDENT VALUES ('S100','Smith','mgt','finance','t5','f');
INSERT INTO STUDENT VALUES ('S123','Smith','comp-sci','acct','t98','m');
INSERT INTO STUDENT VALUES ('S678','James','comp-sci','mkt','t96','m');
INSERT INTO STUDENT VALUES ('S345','Young','comp-sci','math','t82','m');
INSERT INTO STUDENT VALUES ('S124','Jones','acct','mgt','t42','f');
INSERT INTO STUDENT VALUES ('S200','Jhonson','comp-sci','math','t21','m');
INSERT INTO STUDENT VALUES ('S456','Green','math','comp-sci','t98','m');

In [ ]:

DROP TABLE DEPT_CHAIR;
create table DEPT_CHAIR (
    DNO VARCHAR(5) not null,
    TNUMB VARCHAR(5) NOT NULL,
    START_DATE DATE,
    END_DATE DATE,
    CONSTRAINT DNO_FK3 FOREIGN KEY (DNO) REFERENCES DEPARTMENT(DNO),
    CONSTRAINT TNUMB_FK3 FOREIGN KEY (TNUMB) REFERENCES TEACHER(TNUMB)
);

INSERT INTO DEPT_CHAIR VALUES('d11','t21','1-Sep-2002','30-Aug-2001');
INSERT INTO DEPT_CHAIR VALUES('d11','t79','1-Sep-2011','30-Aug-2014');
INSERT INTO DEPT_CHAIR VALUES('d11','t42','1-Sep-2012','30-Aug-2018');
INSERT INTO DEPT_CHAIR VALUES('d11','t75','1-Sep-2018',NULL);
INSERT INTO DEPT_CHAIR VALUES('d14','t9','1-Sep-2013', NULL);
INSERT INTO DEPT_CHAIR VALUES('d5','t96','1-Sep-2002', NULL);
INSERT INTO DEPT_CHAIR VALUES('d9','t5','1-Sep-2008',NULL);

In [ ]:
DROP TABLE TEACHER_RANK
CREATE TABLE TEACHER_RANK (
RANKID VARCHAR(5) PRIMARY KEY NOT NULL,
RANK_TITLE VARCHAR(50) NOT NULL);

INSERT INTO TEACHER_RANK VALUES('1','PROFESSOR');
INSERT INTO TEACHER_RANK VALUES('2','ASSOCIATE PROFESSOR');
INSERT INTO TEACHER_RANK VALUES('3','ASSISTANT PROFESSOR');
INSERT INTO TEACHER_RANK VALUES('4','INSTRUCTOR');
INSERT INTO TEACHER_RANK VALUES('5','ADJUNCT');
INSERT INTO TEACHER_RANK VALUES('6','TEACHING_ASSISTANT');
SELECT * FROM TEACHER_RANK;

In [ ]:
DROP TABLE RANK_SAL_RANGE;
CREATE TABLE RANK_SAL_RANGE(
RANKID VARCHAR(5) NOT NULL,
START_AMT NUMBER(8) NOT NULL,
END_AMT NUMBER(8) NOT NULL,
CONSTRAINT RANKID_FK FOREIGN KEY (RANKID) REFERENCES TEACHER_RANK(RANKID));

INSERT INTO RANK_SAL_RANGE VALUES('1', 120000, 180000);
INSERT INTO RANK_SAL_RANGE VALUES('2',100000, 119900);
INSERT INTO RANK_SAL_RANGE VALUES('3', 82000, 99900);
INSERT INTO RANK_SAL_RANGE VALUES('4', 50000, 79900);
INSERT INTO RANK_SAL_RANGE VALUES('5', 6000, 12000);
SELECT * FROM RANK_SAL_RANGE;

In [ ]:
CREATE TABLE TEACHER_RANK_SALARY(
TNUMB VARCHAR(10) NOT NULL,
RANKID VARCHAR(10) NOT NULL,
SAL_AMT NUMBER(10) NOT NULL,
END_DATE DATE,
START_DATE DATE PRIMARY KEY,
CONSTRAINT TNUMB_FK4 FOREIGN KEY (TNUMB) REFERENCES TEACHER(TNUMB),
CONSTRAINT RANKID_FK2 FOREIGN KEY (RANKID) REFERENCES TEACHER_RANK(RANKID));


INSERT INTO TEACHER_RANK_SALARY VALUES('t96', 1, 120000, NULL, '01-Jan-20');
INSERT INTO TEACHER_RANK_SALARY VALUES('t96', 2, 115000, '30-Dec-2019', NULL);
INSERT INTO TEACHER_RANK_SALARY VALUES('t96', 3, 92000, '12-Dec-2012', '01-Sep-07');
INSERT INTO TEACHER_RANK_SALARY VALUES('t21', 2, 100000, NULL, '01-Sep-18');
INSERT INTO TEACHER_RANK_SALARY VALUES('t21', 3, 78000,'30-AUG-2018', '01-Sep-10');
INSERT INTO TEACHER_RANK_SALARY VALUES('t79', 3, 80000, NULL, '01-Sep-15');
INSERT INTO TEACHER_RANK_SALARY VALUES('t42', 4, 60000, NULL, '01-Jan-18');
INSERT INTO TEACHER_RANK_SALARY VALUES('t5', 1, 130000, NULL, '01-Sep-17');
INSERT INTO TEACHER_RANK_SALARY VALUES('t5', 2, 119000, '30-Aug-2017', '01-Sep-06');
INSERT INTO TEACHER_RANK_SALARY VALUES('t9', 3, 85000, NULL, '01-Sep-06');
INSERT INTO TEACHER_RANK_SALARY VALUES('t75', 2, 105000, NULL, '01-Sep-06');
INSERT INTO TEACHER_RANK_SALARY VALUES('t100', 1, 140000, NULL, '01-Sep-16');